artillery-baseline.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 10
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - flow:
      - get:
          url: "/api/restaurants"
      - post:
          url: "/api/auth/login"
          json:
            email: "user1@example.in"
            password: "password123"
          capture:
            - json: "$.token"
              as: "token"
      - get:
          url: "/api/orders/history"
          headers:
            Authorization: "Bearer {{ token }}"
      - post:
          url: "/api/orders"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            restaurant_id: 1
            delivery_fee: 40.0
            items:
              - menu_item_id: 1
                quantity: 2
                price: 250.0